---
type: StairsComponentConnection
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 6
tags: [revit-api, class]
---

# StairsComponentConnection

`Autodesk.Revit.DB.Architecture.StairsComponentConnection` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ConnectionType | 2014 | `public StairsComponentConnectionEndType ConnectionType { get ; }` |
| Property | ElementId | 2014 | `public ElementId ElementId { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PeerConnectionType | 2014 | `public StairsComponentConnectionEndType PeerConnectionType { get ; }` |
| Property | PeerElementId | 2014 | `public ElementId PeerElementId { get ; }` |